---
kind: method
id: M:Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.#ctor
source: html/095457b7-b6ca-38fd-6450-532d58bed609.htm
---
# Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.#ctor Method

Creates a default segment data object.

## Syntax (C#)
```csharp
public MEPNetworkSegmentData()
```